tap "argoproj/tap"
tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "denisidoro/tools"
tap "derailed/k9s"
tap "derailed/popeye"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kryptco/tap"
tap "minio/stable"
tap "nektos/tap"
tap "rs/tap"
tap "wagoodman/dive"
tap "xo/xo"

brew "ack"
brew "annie"
brew "readline"
brew "sqlite"
brew "ansible"
brew "ansible-cmdb"
brew "ansible-lint"
brew "ant"
brew "aria2", restart_service: true
brew "assh"
brew "astyle"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bitwarden-cli"
brew "black"
brew "blink1"
brew "boost"
brew "cheat"
brew "checkstyle"
brew "clipper", restart_service: true
brew "cmake"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "curl"
brew "go"
brew "dep"
brew "devd"
brew "dfu-util"
brew "direnv"
brew "docker-completion"
brew "dos2unix"
brew "editorconfig"
brew "filebeat"
brew "findutils"
brew "flake8"
brew "fop"
brew "fpp"
brew "git"
brew "git-flow-avh"
brew "git-lfs"
brew "github-release"
brew "glances"
brew "glide"
brew "gnu-indent"
brew "pinentry"
brew "gnupg", link: false
brew "gost"
brew "gpg-agent"
brew "gradle"
brew "graphviz"
brew "grep"
brew "groovy"
brew "gstreamer"
brew "gst-plugins-base"
brew "gst-libav"
brew "gst-plugins-bad"
brew "gst-plugins-good"
brew "gst-plugins-ugly"
brew "hadolint"
brew "helm"
brew "helm@2"
brew "helmfile"
brew "howdoi"
brew "htop"
brew "hub"
brew "hugo"
brew "icdiff"
brew "imagemagick"
brew "inlets"
brew "iperf3"
brew "jfrog-cli-go"
brew "jmeter"
brew "jq"
brew "jsonlint"
brew "pandoc"
brew "jupyterlab"
brew "kompose"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "kubernetes-service-catalog-client"
brew "kustomize"
brew "lf"
brew "libpcap"
brew "librsvg"
brew "logstash"
brew "macvim", args: ["HEAD"]
brew "mas"
brew "maven"
brew "md5sha1sum", link: false
brew "mitmproxy"
brew "mkcert"
brew "modd"
brew "mosh"
brew "most"
brew "mypy"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netlify-cli"
brew "nmap"
brew "noti"
brew "octant"
brew "openconnect"
brew "opencv"
brew "socat"
brew "openshift-cli"
brew "optipng"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "pbzip2"
brew "pigz"
brew "piknik"
brew "pinentry-mac"
brew "pipebench"
brew "platformio"
brew "postgresql"
brew "prettier"
brew "pulumi"
brew "pv"
brew "qrencode"
brew "rancher-cli"
brew "rclone"
brew "reattach-to-user-namespace"
brew "redis"
brew "restic"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "sassc"
brew "shellcheck"
brew "sops"
brew "sqlparse"
brew "ssh-copy-id"
brew "sshuttle"
brew "sslscan"
brew "stern"
brew "telnet"
brew "terraform"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tmux-xpanes"
brew "tmuxinator"
brew "tmuxinator-completion"
brew "topgrade"
brew "tree"
brew "truncate", link: false
brew "ttyd"
brew "unar"
brew "up"
brew "vault"
brew "velero"
brew "wget"
brew "wtfutil"
brew "yamllint"
brew "yank"
brew "yarn"
brew "ykpers"
brew "youtube-dl"
brew "yq"
brew "zopfli"
brew "zsh"

brew "argoproj/tap/argo"
brew "argoproj/tap/argocd"
brew "cjbassi/gotop/gotop"
brew "denisidoro/tools/navi"
brew "derailed/k9s/k9s"
brew "derailed/popeye/popeye"
brew "go-task/tap/go-task"
brew "kryptco/tap/kr"
brew "minio/stable/mc"
brew "nektos/tap/act"
brew "rs/tap/curlie"
brew "wagoodman/dive/dive"
brew "xo/xo/usql", args: ["with-odbc", "with-oracle"]

cask "adoptopenjdk8"
cask "adium"
cask "appcleaner"
cask "arq"
cask "balenaetcher"
cask "basictex"
cask "beyond-compare"
cask "bitwarden"
cask "docker"
cask "dozer"
cask "drawio"
cask "expandrive"
cask "fontbase"
cask "fork"
cask "forklift"
cask "github"
cask "gitscout"
cask "gitup"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "jd-gui"
cask "keystore-explorer"
cask "kube-forwarder"
cask "macpass"
cask "microsoft-teams"
cask "mpv"
cask "paw"
cask "powershell"
cask "psequel"
cask "pullover"
cask "seafile-client"
cask "skim"
cask "skype"
cask "skype-for-business"
cask "ssh-tunnel-manager"
cask "tableflip"
cask "tableplus"
cask "transmit"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "Annotate", id: 918207447
mas "Base", id: 402383384
mas "BreakTime", id: 427475982
mas "CodeRunner", id: 955297617
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Disk Speed Test", id: 425264550
mas "Fantastical", id: 975937182
mas "GIF Brewery 3", id: 1081413713
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Microsoft Remote Desktop", id: 715768417
mas "MindNode", id: 1289197285
mas "Monodraw", id: 920404675
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "Pixave", id: 924891282
mas "Pixelmator", id: 407963104
mas "Reeder", id: 1449412482
mas "Rested", id: 421879749
mas "Serial", id: 877615577
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "SQLPro for Oracle", id: 1078273164
mas "Telegram", id: 747648890
mas "The Hit List", id: 432764806
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "WiFi Scanner", id: 411680127
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Xee³", id: 639764244
