
tap "argoproj/tap"
tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "denisidoro/tools"
tap "derailed/k9s"
tap "derailed/popeye"
tap "garden-io/garden"
tap "go-task/tap"
tap "gobuffalo/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "kryptco/tap"
tap "minio/stable"
tap "nektos/tap"
tap "rs/tap"
tap "wagoodman/dive"
tap "xo/xo"

brew "ack"                                             # Search tool like grep, but optimized for programmers
brew "annie"                                           # Fast, simple and clean video downloader
brew "readline"                                        # Library for command-line editing
brew "sqlite"                                          # Command-line interface for SQLite
brew "ansible"                                         # Automate deployment, configuration, and upgrading
brew "ansible-cmdb"                                    # Generates static HTML overview page from Ansible facts
brew "ansible-lint"                                    # Checks ansible playbooks for practices and behaviour
brew "ant"                                             # Java build tool
brew "aria2"                                           # Download with resuming and segmented downloading
brew "assh"                                            # Advanced SSH config - Regex, aliases, gateways, includes and dynamic hosts
brew "astyle"                                          # Source code beautifier for C, C++, C, and Java
brew "automake"                                        # Tool for generating GNU Standards-compliant Makefiles
brew "azure-cli"                                       # Microsoft Azure CLI 2.0
brew "bash"                                            # Bourne-Again SHell, a UNIX command interpreter
brew "bitwarden-cli"                                   # Secure and free password manager for all of your devices
brew "black"                                           # Python code formatter
brew "blink1"                                          # Control blink(1) indicator light
brew "boost"                                           # Collection of portable C++ source libraries
brew "cmake"                                           # Cross-platform make
brew "cheat"                                           # Create and view interactive cheat sheets for *nix commands
brew "checkstyle"                                      # Check Java source against a coding standard
brew "clipper", restart_service: true                  # Share macOS clipboard with tmux and other local and remote apps
brew "rlwrap"                                          # Readline wrapper: adds readline support to tools that lack it
brew "clojure"                                         # The Clojure Programming Language
brew "coreutils"                                       # GNU File, Shell, and Text utilities
brew "ctags"                                           # Reimplementation of ctags(1)
brew "ctop"                                            # Top-like interface for container metrics
brew "curl"                                            # Get a file from an HTTP, HTTPS or FTP server
brew "go"                                              # Open source programming language to build simple/reliable/efficient software
brew "dep"                                             # Go dependency management tool
brew "devd"                                            # Local webserver for developers
brew "dfu-util"                                        # USB programmer
brew "direnv"                                          # Load/unload environment variables based on $PWD
brew "docker-completion"                               # Bash, Zsh and Fish completion for Docker
brew "dos2unix"                                        # Convert text between DOS, UNIX, and Mac formats
brew "editorconfig"                                    # Maintain consistent coding style between multiple editors
brew "filebeat"                                        # File harvester to ship log files to Elasticsearch or Logstash
brew "findutils"                                       # Collection of GNU find, xargs, and locate
brew "flake8"                                          # Lint your Python code for style and logical errors
brew "fop"                                             # XSL-FO print formatter for making PDF or PS documents
brew "fpp"                                             # CLI program that accepts piped input and presents files for selection
brew "git"                                             # Distributed revision control system
brew "git-flow-avh"                                    # AVH edition of git-flow
brew "git-lfs"                                         # Git extension for versioning large files
brew "github-release"                                  # Create and edit releases on Github (and upload artifacts)
brew "glances"                                         # Alternative to top/htop
brew "glide"                                           # Simplified Go project management, dependency management, and vendoring
brew "gnu-indent"                                      # C code prettifier
brew "pinentry"                                        # Passphrase entry dialog utilizing the Assuan protocol
brew "gnupg", link: false                              # GNU Pretty Good Privacy (PGP) package
brew "gost"                                            # Simple command-line utility for easily creating Gists for Github.
brew "gpg-agent"                                       # GPG key agent
brew "gradle"                                          # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "graphviz"                                        # Graph visualization software from AT&T and Bell Labs
brew "grep"                                            # GNU grep, egrep and fgrep
brew "groovy"                                          # Java-based scripting language
brew "gstreamer"                                       # Development framework for multimedia applications
brew "gst-plugins-base"                                # GStreamer plugins (well-supported, basic set)
brew "gst-libav"                                       # GStreamer plugins for Libav (a fork of FFmpeg)
brew "gst-plugins-bad"                                 # GStreamer plugins less supported, not fully tested
brew "gst-plugins-good"                                # GStreamer plugins (well-supported, under the LGPL)
brew "gst-plugins-ugly"                                # Library for constructing graphs of media-handling components
brew "hadolint"                                        # Smarter Dockerfile linter to validate best practices
brew "helm"                                            # The Kubernetes package manager
brew "helm@2"                                          # The Kubernetes package manager
brew "helmfile"                                        # Deploy Kubernetes Helm Charts
brew "howdoi"                                          # Instant coding answers via the command-line
brew "htop"                                            # Improved top (interactive process viewer)
brew "hub"                                             # Add GitHub support to git on the command-line
brew "hugo"                                            # Configurable static site generator
brew "icdiff"                                          # Improved colored diff
brew "imagemagick"                                     # Tools and libraries to manipulate images in many formats
brew "inlets"                                          # Expose your local endpoints to the Internet
brew "iperf3"                                          # Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "jfrog-cli-go"                                    # Command-line interface for Jfrog Artifactory and Bintray
brew "jmeter"                                          # Load testing and performance measurement application
brew "jq"                                              # Lightweight and flexible command-line JSON processor
brew "jsonlint"                                        # JSON parser and validator with a CLI
brew "pandoc"                                          # Swiss-army knife of markup format conversion
brew "jupyterlab"                                      # Interactive environments for writing and running code
brew "kompose"                                         # Tool to move from `docker-compose` to Kubernetes
brew "kubernetes-cli"                                  # Kubernetes command-line interface
brew "kops"                                            # Production Grade K8s Installation, Upgrades, and Management
brew "kubectx"                                         # Tool that can switch between kubectl contexts easily and create aliases
brew "kubernetes-service-catalog-client"               # Consume Services in k8s using the OSB API
brew "kustomize"                                       # Template-free customization of Kubernetes YAML manifests
brew "lf"                                              # Terminal file manager
brew "libpcap"                                         # Portable library for network traffic capture
brew "librsvg"                                         # Library to render SVG files using Cairo
brew "logstash"                                        # Tool for managing events and logs
brew "macvim", args: ["HEAD"]                          # GUI for vim, made for macOS
brew "mas"                                             # Mac App Store command-line interface
brew "maven"                                           # Java-based project management
brew "md5sha1sum", link: false                         # Hash utilities
brew "mitmproxy"                                       # Intercept, modify, replay, save HTTP/S traffic
brew "mkcert"                                          # Simple tool to make locally trusted development certificates
brew "modd"                                            # Flexible tool for responding to filesystem changes
brew "mosh"                                            # Remote terminal application
brew "most"                                            # Powerful paging program
brew "mypy"                                            # Experimental optional static type checker for Python
brew "ncdu"                                            # NCurses Disk Usage
brew "neofetch"                                        # Fast, highly customisable system info script
brew "neovim"                                          # Ambitious Vim-fork focused on extensibility and agility
brew "netlify-cli"                                     # Netlify command-line tool
brew "nmap"                                            # Port scanning utility for large networks
brew "noti"                                            # Trigger notifications when a process completes
brew "octant"                                          # Kubernetes introspection tool for developers
brew "openconnect"                                     # Open client for Cisco AnyConnect VPN
brew "opencv"                                          # Open source computer vision library
brew "optipng"                                         # PNG file optimizer
brew "p7zip"                                           # 7-Zip (high compression file archiver) implementation
brew "packer"                                          # Tool for creating identical machine images for multiple platforms
brew "packer-completion"                               # Bash completion for Packer
brew "pandoc-citeproc"                                 # Library and executable for using citeproc with pandoc
brew "pbzip2"                                          # Parallel bzip2
brew "pigz"                                            # Parallel gzip
brew "piknik"                                          # Copy/paste anything over the network
brew "pinentry-mac"                                    # Pinentry for GPG on Mac
brew "pipebench"                                       # Measure the speed of STDIN/STDOUT communication
brew "platformio"                                      # An open-source ecosystem for embedded development
brew "postgresql"                                      # Object-relational database system
brew "prettier"                                        # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "pulumi"                                          # Cloud native development platform
brew "pv"                                              # Monitor data's progress through a pipe
brew "qrencode"                                        # QR Code generation
brew "rancher-cli"                                     # The Rancher CLI is a unified tool to manage your Rancher server
brew "rclone"                                          # Rsync for cloud storage
brew "reattach-to-user-namespace"                      # Reattach process (e.g., tmux) to background
brew "redis"                                           # Persistent key-value database, with built-in net interface
brew "renameutils"                                     # Tools for file renaming
brew "restic"                                          # Fast, efficient and secure backup program
brew "ripgrep"                                         # Search tool like grep and The Silver Searcher
brew "rsync"                                           # Utility that provides fast incremental file transfer
brew "sassc"                                           # Wrapper around libsass that helps to create command-line apps
brew "shellcheck"                                      # Static analysis and lint tool, for (ba)sh scripts
brew "socat"                                           # SOcket CAT: netcat on steroids
brew "sops"                                            # Editor of encrypted files
brew "sqlparse"                                        # Non-validating SQL parser
brew "ssh-copy-id"                                     # Add a public key to a remote machine's authorized_keys file
brew "sshuttle"                                        # Proxy server that works as a poor man's VPN
brew "sslscan"                                         # Test SSL/TLS enabled services to discover supported cipher suites
brew "stern"                                           # Tail multiple Kubernetes pods & their containers
brew "telnet"                                          # User interface to the TELNET protocol (built from macOS Sierra sources)
brew "terraform"                                       # Tool to build, change, and version infrastructure
brew "the_silver_searcher"                             # Code-search similar to ack
brew "tldr"                                            # Simplified and community-driven man pages
brew "tmux"                                            # Terminal multiplexer
brew "tmux-xpanes"                                     # Ultimate terminal divider powered by tmux
brew "tmuxinator"                                      # Manage complex tmux sessions easily
brew "tmuxinator-completion", link: false              # Shell completion for Tmuxinator
brew "topgrade"                                        # Upgrade all the things
brew "tree"                                            # Display directories as trees (with optional color/HTML output)
brew "truncate", link: false                           # Truncates a file to a given size
brew "ttyd"                                            # Command-line tool for sharing terminal over the web
brew "unar"                                            # Command-line unarchiving tools supporting multiple formats
brew "up"                                              # Tool for writing command-line pipes with instant live preview
brew "vault"                                           # Secures, stores, and tightly controls access to secrets
brew "velero"                                          # Disaster recovery for Kubernetes resources and persistent volumes
brew "wget"                                            # Internet file retriever
brew "wtfutil"                                         # The personal information dashboard for your terminal
brew "yamllint"                                        # Linter for YAML files
brew "yank"                                            # Copy terminal output to clipboard
brew "yarn"                                            # JavaScript package manager
brew "ykpers"                                          # YubiKey personalization library and tool
brew "youtube-dl"                                      # Download YouTube videos from the command-line
brew "yq"                                              # Process YAML documents from the CLI
brew "zopfli"                                          # New zlib (gzip, deflate) compatible compressor
brew "zsh"                                             # UNIX shell (command interpreter)
brew "argoproj/tap/argo"                               # Get stuff done with container-native workflows for Kubernetes.
brew "argoproj/tap/argocd"                             # GitOps Continuous Delivery for Kubernetes
brew "cjbassi/gotop/gotop"                             # A terminal based graphical activity monitor inspired by gtop and vtop
brew "denisidoro/tools/navi", args: ["HEAD"]           # Interactive cheatsheet tool for the command-line
brew "derailed/k9s/k9s"                                # Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/popeye/popeye"                          # A Kubernetes Cluster sanitizer and linter.
brew "garden-io/garden/garden-cli"                     # Development engine for Kubernetes
brew "go-task/tap/go-task"                             # Task runner / simpler Make alternative written in Go
brew "jesseduffield/lazydocker/lazydocker"             # A simple terminal UI for docker, written in Go
brew "kryptco/tap/kr"                                  # Krypton command-line client, daemon, and SSH integration
brew "minio/stable/mc"                                 # MinIO Client for object storage and filesystems
brew "nektos/tap/act"                                  # Run GitHub Actions locally
brew "rs/tap/curlie"                                   # The power of curl, the ease of use of httpie.
brew "wagoodman/dive/dive"                             # A tool for exploring each layer in a docker image
brew "xo/xo/usql", args: ["with-odbc", "with-oracle"]  # universal command-line SQL client interface

cask "adoptopenjdk8"
cask "adium"
cask "appcleaner"
cask "arq"
cask "balenaetcher"
cask "basictex"
cask "beyond-compare"
cask "bitwarden"
cask "docker"
cask "drawio"
cask "expandrive"
cask "fontbase"
cask "fork"
cask "forklift"
cask "fritzing"
cask "github"
cask "gitscout"
cask "gitup"
cask "gpg-suite"
cask "inkscape"
cask "iterm2"
cask "java"
cask "jd-gui"
cask "keystore-explorer"
cask "kube-forwarder"
cask "macpass"
cask "microsoft-teams"
cask "mjml"
cask "mpv"
cask "openconnect-gui"
cask "paw"
cask "powershell"
cask "psequel"
cask "pullover"
cask "seafile-client"
cask "sequel-pro-nightly"
cask "skim"
cask "skype"
cask "skype-for-business"
cask "ssh-tunnel-manager"
cask "tableflip"
cask "tableplus"
cask "transmit"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"

mas "Affinity Designer", id: 824171161
mas "Amphetamine", id: 937984704
mas "Annotate", id: 918207447
mas "Base", id: 402383384
mas "BreakTime", id: 427475982
mas "CodeRunner", id: 955297617
mas "DaisyDisk", id: 411643860
mas "Deliveries", id: 924726344
mas "Disk Speed Test", id: 425264550
mas "Fantastical", id: 975937182
mas "GIF Brewery 3", id: 1081413713
mas "Hidden Bar", id: 1452453066
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Microsoft Remote Desktop", id: 1295203466
mas "MindNode", id: 1289197285
mas "MobilePASS", id: 972648459
mas "Monodraw", id: 920404675
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "Pixelmator", id: 407963104
mas "Reeder", id: 1449412482
mas "Rested", id: 421879749
mas "Serial", id: 877615577
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "SQLPro for Oracle", id: 1078273164
mas "Telegram", id: 747648890
mas "The Hit List", id: 432764806
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "WiFi Scanner", id: 411680127
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
mas "Xee³", id: 639764244

